tangyangguang/Esp8266Base/src/Esp8266BaseWeb.cpp
#include "Esp8266BaseRecordStore.h"
#include "Esp8266BaseOptions.h"
#if ESP8266BASE_USE_JOURNAL
#include "Esp8266BaseJournal.h"
#endif
#if ESP8266BASE_USE_WEB
#include "Esp8266BaseWeb.h"
#include "Esp8266BaseStreamWrite.h"
#include "Esp8266BaseWebJson.h"
#include "Esp8266BaseLog.h"
#if ESP8266BASE_USE_FILELOG
#include "Esp8266BaseFileLog.h"
#endif
#if ESP8266BASE_USE_CONFIG
#include "Esp8266BaseConfig.h"
#endif
#include "Esp8266BaseWiFi.h"
#include "Esp8266BaseUtil.h"
#include "Esp8266Base.h"
#if ESP8266BASE_USE_OTA
#include "Esp8266BaseOTA.h"
#endif
#if ESP8266BASE_USE_NTP
#include "Esp8266BaseNTP.h"
#endif
#if ESP8266BASE_USE_SLEEP
#include "Esp8266BaseSleep.h"
#endif
#if ESP8266BASE_USE_WATCHDOG
#include "Esp8266BaseWatchdog.h"
#endif
#if ESP8266BASE_USE_MQTT
#include "Esp8266BaseMQTT.h"
#endif
#if ESP8266BASE_USE_FILELOG
#include <LittleFS.h>
#endif
#include <time.h>

// ----------------------------------------------------------------------------
// 静态成员定义
// ----------------------------------------------------------------------------
ESP8266WebServer         Esp8266BaseWeb::_server(80);
#if ESP8266BASE_WEB_MAX_APP_PAGES > 0
Esp8266BaseWeb::AppRoute Esp8266BaseWeb::_pages[ESP8266BASE_WEB_MAX_APP_PAGES];
#endif
#if ESP8266BASE_WEB_MAX_APP_APIS > 0
Esp8266BaseWeb::AppRoute Esp8266BaseWeb::_apis [ESP8266BASE_WEB_MAX_APP_APIS];
#endif
#if ESP8266BASE_WEB_MAX_APP_PAGES > 0
uint8_t                  Esp8266BaseWeb::_pageCount = 0;
#endif
#if ESP8266BASE_WEB_MAX_APP_APIS > 0
uint8_t                  Esp8266BaseWeb::_apiCount  = 0;
#endif
bool                     Esp8266BaseWeb::_running   = false;
uint32_t                 Esp8266BaseWeb::_lastActivityMs = 0;
char                     Esp8266BaseWeb::_authUser[24] = ESP8266BASE_WEB_AUTH_USER;
char                     Esp8266BaseWeb::_authPass[24] = ESP8266BASE_WEB_AUTH_PASS;
char                     Esp8266BaseWeb::_deviceName[24] = "";
#if !ESP8266BASE_PROFILE_MQTT_TERMINAL
char                     Esp8266BaseWeb::_homePath[24] = "";
#endif
char                     Esp8266BaseWeb::_hostname[33] = "esp8266base";
char                     Esp8266BaseWeb::_fwName[24] = "esp8266base";
char                     Esp8266BaseWeb::_fwVersion[16] = "1.0.0";
#if !ESP8266BASE_PROFILE_MQTT_TERMINAL
uint32_t                 Esp8266BaseWeb::_bootCount = 0;
char                     Esp8266BaseWeb::_titleBuf[80] = "ESP8266";
#endif
char                     Esp8266BaseWeb::_activeUri[32] = "";
char                     Esp8266BaseWeb::_activeMethod[5] = "";
uint32_t                 Esp8266BaseWeb::_formToken = 0;
#if !ESP8266BASE_PROFILE_MQTT_TERMINAL
char                     Esp8266BaseWeb::_builtinLabels[3][16] = {
    "Status", "Logs", "System"
};
Esp8266BaseWebHomeMode Esp8266BaseWeb::_homeMode = Esp8266BaseWebHomeMode::DEFAULT_SYSTEM_HOME;
Esp8266BaseWebSystemNavMode Esp8266BaseWeb::_systemNavMode = Esp8266BaseWebSystemNavMode::TOP_NAV;
#endif

// ----------------------------------------------------------------------------
// PROGMEM HTML 片段（全部在 Flash，不占 DRAM）
// ----------------------------------------------------------------------------
#if ESP8266BASE_PROFILE_MQTT_TERMINAL
static const char WEB_HEAD[] PROGMEM =
    "<meta charset=UTF-8><meta name=viewport content='width=device-width,initial-scale=1'>"
    "<style>body{font-family:Arial,sans-serif;padding:12px;max-width:640px;margin:auto;line-height:1.45}"
    "nav{margin-bottom:14px}a,input{margin:3px;padding:6px}footer{color:#666;font-size:12px;margin-top:14px}</style>"
    "<script>function once(f){if(f.dataset.busy)return false;f.dataset.busy=1;"
    "var b=f.querySelector('[type=submit]');if(b)b.disabled=true;return true;}</script>"
    "</head><body><nav>";
#else
static const char WEB_HEAD[] PROGMEM =
    "<meta charset=UTF-8><meta name=viewport content='width=device-width,initial-scale=1'>"
    "<style>"
    "body{font-family:Arial,Helvetica,sans-serif;padding:12px;max-width:920px;margin:0 auto;"
    "font-size:15px;font-weight:normal;color:#222;line-height:1.45}"
    "h2{margin:0 0 14px;font-size:22px;font-weight:600;line-height:1.25}"
    "p{margin:0 0 12px}"
    "a,input[type=submit],input[type=button]{background:#2f6fb3;color:#fff;padding:6px 10px;"
    "text-decoration:none;border:none;border-radius:3px;cursor:pointer;margin:2px 2px 2px 0;"
    "font-size:14px;font-weight:normal}"
    "input:not([type=submit]):not([type=button]):not([type=radio]):not([type=checkbox]){width:100%;padding:7px;margin:4px 0 12px;"
    "font-size:15px;"
    "border:1px solid #ccc;border-radius:3px;box-sizing:border-box}"
    "label{display:inline-flex;align-items:center;gap:4px;margin:4px 10px 8px 0}"
    "input[type=radio],input[type=checkbox]{width:auto;margin:0}"
    "input.danger{background:#c23b35}"
    "nav{margin-bottom:16px;border-bottom:1px solid #e5e5e5;padding-bottom:10px;display:flex;flex-wrap:wrap;gap:4px;align-items:center}"
    "nav a{font-size:14px}.brand{background:transparent;color:#222;font-weight:600;padding-left:0}"
    ".grid{display:grid;grid-template-columns:repeat(auto-fit,minmax(240px,1fr));gap:12px;margin:14px 0}"
    "section{border:1px solid #e5e5e5;border-radius:4px;padding:12px;background:#fafafa;min-width:0}"
    "h3{margin:0 0 10px;font-size:16px;font-weight:600;line-height:1.25}"
    "dl{margin:0;display:grid;grid-template-columns:104px minmax(0,1fr);gap:5px 10px;font-size:14px}"
    "dt{color:#666;min-width:0;white-space:nowrap}dd{margin:0;min-width:0;overflow-wrap:break-word}"
    "pre{font-size:13px;font-weight:normal;line-height:1.35;overflow-x:auto}"
    ".sysnav{margin-top:14px;padding-top:8px;border-top:1px solid #e5e5e5;display:flex;flex-wrap:wrap;gap:4px}"
    ".tabs{display:flex;flex-wrap:wrap;gap:4px;align-items:center}"
    ".tabs span{white-space:nowrap}"
    ".tabs a,.tabs b{background:#f4f4f4;color:#333;padding:4px 7px;border-radius:3px;"
    "font-size:13px;text-decoration:none;margin:0;font-weight:normal;white-space:nowrap}"
    ".tabs b{background:#333;color:#fff;font-weight:normal}"
    ".ok{color:#188038}.err{color:#c5221f}"
    "footer{color:#777;font-size:12px;margin-top:16px;display:flex;flex-wrap:wrap;gap:6px;align-items:center}"
    "footer .tools{flex:1 1 auto;display:flex;flex-wrap:wrap;gap:4px}"
    "footer a{font-size:12px;background:#f4f4f4;color:#666;padding:3px 6px;border-radius:3px}"
    "footer .status{white-space:nowrap;margin-left:auto}"
    "@media(max-width:700px){footer{border:1px solid #d9e1e8;border-radius:6px;padding:10px;"
    "align-items:flex-start;background:#fff}footer .tools{flex:1 0 100%;gap:5px}"
    "footer a{font-size:14px;padding:5px 8px}footer .status{margin-left:0;white-space:normal;font-size:14px}}"
    "</style>"
    "<script>"
    "function once(f){if(f.dataset.busy)return false;f.dataset.busy=1;"
    "var b=f.querySelector('[type=submit]');if(b)b.disabled=true;return true;}"
    "</script></head><body><nav>";
#endif

