tangyangguang/Esp8266Base/src/Esp8266BaseWeb.cpp
static const char WEB_NAV_END[]    PROGMEM = "</nav>";
static const char WEB_FOOT_PRE[]   PROGMEM = "<footer>";
static const char WEB_FOOT_HEAP_PRE[] PROGMEM = "<span class=status>Free heap: ";
static const char WEB_FOOT_UP_PRE[] PROGMEM = " &middot; Up: ";
static const char WEB_FOOT_RSSI_PRE[] PROGMEM = " &middot; RSSI: ";
static const char WEB_FOOT_POST[]  PROGMEM = "</span></footer></body></html>";

static const char WEB_WIFI_FORM_PRE[] PROGMEM =
    "<h2>WiFi Settings</h2>"
    "<form method=post onsubmit=\""
    "var s=this.ssid.value;"
    "if(!s.length){alert('SSID cannot be empty');return false;}"
    "return once(this);\">";

static const char WEB_WIFI_FORM_SSID[] PROGMEM =
    "SSID<input type=text name=ssid maxlength=32 autocomplete=off required value=\"";

static const char WEB_WIFI_FORM_MID[] PROGMEM =
    "\">Password<input id=wp type=password name=pass maxlength=63 value=\"";

static const char WEB_WIFI_FORM_POST[] PROGMEM =
    "\"><input type=button value='Show/Hide Password' onclick=\""
    "var p=document.getElementById('wp');p.type=p.type=='password'?'text':'password'\">"
    "<input type=submit value='Save &amp; Connect'>"
    "</form>";

#if ESP8266BASE_USE_OTA && !ESP8266BASE_PROFILE_MQTT_TERMINAL
static const char WEB_OTA_FORM[] PROGMEM =
    "<h2>OTA Update</h2>"
    "<form id=f>"
    "<input id=fw type=file name=firmware accept=.bin required>"
    "<br><br>"
    "<input type=submit value='Upload Firmware'>"
    "</form>"
    "<progress id=pg value=0 max=100 style='width:100%;display:none'></progress>"
    "<p id=st></p>"
    "<script>"
    "document.getElementById('f').onsubmit=function(e){"
    "e.preventDefault();"
    "if(this.dataset.busy)return false;this.dataset.busy=1;"
    "var file=document.getElementById('fw').files[0],st=document.getElementById('st'),pg=document.getElementById('pg');"
    "var b=this.querySelector('[type=submit]');"
    "if(!file){this.dataset.busy='';alert('Choose firmware first');return false;}"
    "function fb(n){if(n<1024)return n+' B';if(n<1048576)return(n/1024).toFixed(2)+' KB';return(n/1048576).toFixed(2)+' MB';}"
    "function le(a,o){return(a[o]|(a[o+1]<<8)|(a[o+2]<<16)|(a[o+3]<<24))>>>0;}"
    "function ok(a){if(a.length<16||a[0]!=233||a[1]<1||a[1]>16||a[2]>3)return false;"
    "var ad=le(a,8),sz=le(a,12);return((ad>=0x40100000&&ad<0x40110000)||(ad>=0x3FFE8000&&ad<0x40000000))&&sz>0&&sz<=65536;}"
    "function fail(m){st.textContent=m;pg.style.display='none';document.getElementById('f').dataset.busy='';if(b)b.disabled=false;}"
    "function send(){var fd=new FormData();fd.append('firmware',file);var x=new XMLHttpRequest();"
    "pg.style.display='block';pg.value=0;st.textContent='Uploading 0%';"
    "x.upload.onprogress=function(ev){if(ev.lengthComputable){var p=Math.floor(ev.loaded*100/ev.total);pg.value=p;st.textContent='Uploading '+p+'% ('+fb(ev.loaded)+'/'+fb(ev.total)+')';}};"
    "x.onload=function(){st.textContent=(x.status==200?x.responseText:('Upload failed: HTTP '+x.status+' '+x.responseText));if(x.status!=200)fail(st.textContent);};"
    "x.onerror=function(){fail('Upload failed: network error');};"
    "x.open('POST','/ota');x.send(fd);}"
    "if(b)b.disabled=true;st.textContent='Checking firmware...';"
    "var r=new FileReader();r.onload=function(){var a=new Uint8Array(r.result);if(!ok(a)){fail('Invalid firmware: not an ESP8266 app image');return;}send();};"
    "r.onerror=function(){fail('Invalid firmware: cannot read file header');};r.readAsArrayBuffer(file.slice(0,16));return false;};"
    "</script>";
#endif

static const char WEB_AUTH_FORM_PRE[] PROGMEM =
    "<h2>Auth Password</h2>"
    "<form method=post onsubmit=\""
    "var c=this.current.value,n=this.newpass.value,r=this.confirm.value;"
    "if(!c){alert('Current password cannot be empty');return false;}"
    "if(!n){alert('New password cannot be empty');return false;}"
    "if(n.length>23){alert('New password is too long');return false;}"
    "if(n!=r){alert('Passwords do not match');return false;}"
    "return once(this);\">";

static const char WEB_AUTH_FORM_FIELDS[] PROGMEM =
    "Current password<input type=password name=current maxlength=23 autocomplete=current-password required>"
    "New password<input type=password name=newpass maxlength=23 autocomplete=new-password required>"
    "Confirm new password<input type=password name=confirm maxlength=23 autocomplete=new-password required>"
    "<input type=submit value='Update Password'>"
    "</form>";

#if !ESP8266BASE_PROFILE_MQTT_TERMINAL
static const char WEB_HOSTNAME_FORM_PRE[] PROGMEM =
    "<section><h3>Hostname</h3>"
    "<p>Current hostname: ";

static const char WEB_HOSTNAME_FORM_MID[] PROGMEM =
    "</p><form method=post action='/system/hostname' onsubmit=\""
    "var h=this.hostname.value.trim();"
    "if(!/^[a-z0-9](?:[a-z0-9-]{0,30}[a-z0-9])?$/.test(h)){"
    "alert('Hostname must be 1-32 lowercase letters, numbers, or hyphens, and cannot start or end with hyphen.');return false;}"
    "return once(this);\">"
    "Hostname<input type=text name=hostname maxlength=32 autocomplete=off required value=\"";

static const char WEB_HOSTNAME_FORM_POST[] PROGMEM =
    "\"><p>Reboot to apply mDNS, OTA discovery, and Web title changes.</p>"
    "<input type=submit value='Save Hostname'>"
    "</form></section>";

static const char WEB_SYSTEM_PAGE[] PROGMEM =
    "<section><h3>Network</h3>"
    "<p><a href='/wifi'>WiFi Settings</a></p>"
    "</section>"
    "<section><h3>Security</h3>"
    "<p><a href='/auth'>Auth Password</a></p>"
    "</section>"
#if ESP8266BASE_USE_OTA
    "<section><h3>Firmware</h3>"
    "<p><a href='/ota'>OTA Update</a></p>"
    "</section>"
#endif
#if ESP8266BASE_USE_FILELOG
    "<section><h3>File Logs</h3>"
    "<p>Clear all rotated file log segments.</p>"
    "<form method=post action='/logs/clear' onsubmit=\"return confirm('Clear file logs?')&&once(this)\">"
    "<input class=danger type=submit value='Clear File Logs'>"
    "</form></section>"
#endif
    "<section><h3>Reboot</h3>"
#if ESP8266BASE_USE_FILELOG
    "<p>Flush pending config and file logs, then restart the device.</p>"
#else
    "<p>Flush pending config, then restart the device.</p>"
#endif
    "<form method=post action='/reboot' onsubmit=\"return confirm('Reboot device now?')&&once(this)\">"
    "<input class=danger type=submit value='Reboot Device'>"
    "</form></section>"
    "</div>";

