tangyangguang/Esp8266Base/src/Esp8266BaseWeb.cpp
static const char WEB_REBOOTING[] PROGMEM =
    "<h2>Rebooting...</h2>"
    "<p>Device is restarting. Please wait a few seconds, then <a href='/'>reload</a>.</p>";

#if ESP8266BASE_USE_FILELOG
static const char WEB_LOGS_PRE[] PROGMEM =
    "<h2>Logs</h2>";
#endif
#endif

#if !ESP8266BASE_PROFILE_MQTT_TERMINAL
static void _trimWhitespace(char* s) {
    if (!s) return;
    char* start = s;
    while (*start == ' ' || *start == '\t' || *start == '\r' || *start == '\n') {
        start++;
    }
    if (start != s) {
        memmove(s, start, strlen(start) + 1);
    }
    size_t len = strlen(s);
    while (len > 0) {
        char c = s[len - 1];
        if (c != ' ' && c != '\t' && c != '\r' && c != '\n') break;
        s[--len] = '\0';
    }
}
#endif

static void _sendAttrEscaped(const char* s) {
    if (!s) return;
    char buf[96];
    size_t out = 0;
    while (*s) {
        const char* repl = nullptr;
        switch (*s) {
            case '&':  repl = "&amp;"; break;
            case '\'': repl = "&#39;"; break;
            case '"':  repl = "&quot;"; break;
            case '<':  repl = "&lt;"; break;
            case '>':  repl = "&gt;"; break;
            default: break;
        }
        if (repl) {
            for (const char* r = repl; *r; r++) {
                buf[out++] = *r;
                if (out == sizeof(buf) - 1) {
                    buf[out] = '\0';
                    Esp8266BaseWeb::sendChunk(buf);
                    out = 0;
                }
            }
        } else {
            buf[out++] = *s;
            if (out == sizeof(buf) - 1) {
                buf[out] = '\0';
                Esp8266BaseWeb::sendChunk(buf);
                out = 0;
            }
        }
        s++;
    }
    if (out > 0) {
        buf[out] = '\0';
        Esp8266BaseWeb::sendChunk(buf);
    }
}

#if !ESP8266BASE_PROFILE_MQTT_TERMINAL && ESP8266BASE_USE_FILELOG
static void _sendLogFileEscaped(const char* path) {
    if (!path || !LittleFS.exists(path)) return;
    File f = LittleFS.open(path, "r");
    if (!f) return;
    char buf[96];
    while (f.available()) {
        size_t n = f.readBytes(buf, sizeof(buf) - 1);
        buf[n] = '\0';
        _sendAttrEscaped(buf);
        yield();
    }
    f.close();
}

static void _sendLogSection(const char* label, const char* path, uint32_t size) {
    char sizeBuf[16];
    Esp8266BaseUtil::formatBytes(size, sizeBuf, sizeof(sizeBuf));
    Esp8266BaseWeb::sendChunk("\n\n----- ");
    Esp8266BaseWeb::sendChunk(label);
    Esp8266BaseWeb::sendChunk(" file=");
    _sendAttrEscaped(path);
    Esp8266BaseWeb::sendChunk(" size=");
    Esp8266BaseWeb::sendChunk(sizeBuf);
    Esp8266BaseWeb::sendChunk(" -----\n");
    _sendLogFileEscaped(path);
}
#endif

static void _redirect(const char* url) {
    Esp8266BaseWeb::server().sendHeader("Location", url);
    Esp8266BaseWeb::server().sendHeader("Cache-Control", "no-store");
    Esp8266BaseWeb::server().send(303);
}

#if !ESP8266BASE_PROFILE_MQTT_TERMINAL
#if ESP8266BASE_USE_FILELOG
static void _sendFileLogModeOption(const char* value,
                                   const char* label,
                                   Esp8266BaseFileLog::Mode mode) {
    Esp8266BaseWeb::sendChunk("<label><input type=radio name=mode value='");
    Esp8266BaseWeb::sendChunk(value);
    Esp8266BaseWeb::sendChunk("'");
    if (Esp8266BaseFileLog::mode() == mode) {
        Esp8266BaseWeb::sendChunk(" checked");
    }
    Esp8266BaseWeb::sendChunk("> ");
    Esp8266BaseWeb::sendChunk(label);
    Esp8266BaseWeb::sendChunk("</label> ");
}

static bool _fileLogModeFromArg(const String& raw, Esp8266BaseFileLog::Mode& mode) {
    if (raw == "off") {
        mode = Esp8266BaseFileLog::OFF;
        return true;
    }
#if ESP8266BASE_LOG_LEVEL <= ESP8266BASE_FILELOG_MODE_ERROR
    if (raw == "error") {
        mode = Esp8266BaseFileLog::ERROR;
        return true;
    }
#endif
#if ESP8266BASE_LOG_LEVEL <= ESP8266BASE_FILELOG_MODE_WARN
    if (raw == "warn") {
        mode = Esp8266BaseFileLog::WARN;
        return true;
    }
#endif
#if ESP8266BASE_LOG_LEVEL <= ESP8266BASE_FILELOG_MODE_INFO
    if (raw == "info") {
        mode = Esp8266BaseFileLog::INFO;
        return true;
    }
#endif
    return false;
}
#endif

static const char* _validatedDefaultHostname() {
    return Esp8266Base::isValidHostname(ESP8266BASE_DEFAULT_HOSTNAME)
        ? ESP8266BASE_DEFAULT_HOSTNAME
        : "esp8266base";
}

#if ESP8266BASE_USE_SLEEP
static const char* _wakeReasonText(const char* reason) {
    if (strcmp(reason, "power-on") == 0) {
        return "power-on (上电启动)";
    }
    if (strcmp(reason, "deep-sleep") == 0) {
        return "deep-sleep (深睡唤醒)";
    }
    if (strcmp(reason, "soft-restart") == 0) {
        return "soft-restart (软件重启)";
    }
    if (strcmp(reason, "wdt-reset") == 0) {
        return "wdt-reset (看门狗重启)";
    }
    return "unknown (未知)";
}
#endif

static void _sendHostnameSystemSection() {
    char persisted[33] = "";
    bool found = Esp8266BaseConfig::getStr(ESP8266BASE_CFG_KEY_HOSTNAME, persisted, sizeof(persisted), "");
    bool persistedValid = found && persisted[0] && Esp8266Base::isValidHostname(persisted);
    const char* formValue = persistedValid ? persisted : Esp8266BaseWeb::server().hasArg("hostname") ? "" : Esp8266Base::hostname();

    Esp8266BaseWeb::sendContent_P(WEB_HOSTNAME_FORM_PRE);
    _sendAttrEscaped(Esp8266Base::hostname());
    Esp8266BaseWeb::sendChunk("<br>mDNS: ");
    _sendAttrEscaped(Esp8266Base::hostname());
    Esp8266BaseWeb::sendChunk(".local");
    if (persistedValid && strcmp(persisted, Esp8266Base::hostname()) != 0) {
        Esp8266BaseWeb::sendChunk("<br>Saved hostname: ");
        _sendAttrEscaped(persisted);
        Esp8266BaseWeb::sendChunk(" (reboot required)");
    }
    Esp8266BaseWeb::sendContent_P(WEB_HOSTNAME_FORM_MID);
    _sendAttrEscaped(formValue);
    Esp8266BaseWeb::sendContent_P(WEB_HOSTNAME_FORM_POST);
}

#if ESP8266BASE_USE_FILELOG
static void _sendFileLogSystemSection() {
    Esp8266BaseWeb::sendChunk("<section><h3>File Log Mode</h3><p>Current mode: ");
    Esp8266BaseWeb::sendChunk(Esp8266BaseFileLog::modeName());
    Esp8266BaseWeb::sendChunk("</p><form method=post action='/system/filelog' onsubmit=\"return once(this)\">");
    _sendFileLogModeOption("off", "Off", Esp8266BaseFileLog::OFF);
#if ESP8266BASE_LOG_LEVEL <= ESP8266BASE_FILELOG_MODE_ERROR
    _sendFileLogModeOption("error", "ERROR", Esp8266BaseFileLog::ERROR);
#endif
#if ESP8266BASE_LOG_LEVEL <= ESP8266BASE_FILELOG_MODE_WARN
    _sendFileLogModeOption("warn", "WARN", Esp8266BaseFileLog::WARN);
#endif
#if ESP8266BASE_LOG_LEVEL <= ESP8266BASE_FILELOG_MODE_INFO
    _sendFileLogModeOption("info", "INFO", Esp8266BaseFileLog::INFO);
#endif
    Esp8266BaseWeb::sendChunk("<p>Mode is capped by the build log level.</p><input type=submit value='Save File Log'></form></section>");
}
#endif
#endif

