tangyangguang/Esp8266Base/src/Esp8266BaseWeb.cpp
#if !ESP8266BASE_PROFILE_MQTT_TERMINAL || ESP8266BASE_WEB_MAX_APP_PAGES > 0 || ESP8266BASE_WEB_MAX_APP_APIS > 0
static bool _isValidPath(const char* path) {
    if (!path || path[0] != '/') return false;
    size_t len = strlen(path);
    if (len <= 1 || len >= 24) return false;
    for (size_t i = 1; i < len; i++) {
        char c = path[i];
        bool ok = (c >= 'a' && c <= 'z') ||
                  (c >= 'A' && c <= 'Z') ||
                  (c >= '0' && c <= '9') ||
                  c == '/' || c == '-' || c == '_' || c == '.';
        if (!ok) return false;
    }
    return true;
}
#endif

#if !ESP8266BASE_PROFILE_MQTT_TERMINAL
const char* Esp8266BaseWeb::_builtinLabel(Esp8266BaseWebBuiltinLabel label) {
    return _builtinLabels[(uint8_t)label];
}
#endif

void Esp8266BaseWeb::_sendLink(const char* path, const char* title, const char* cls) {
    Esp8266BaseWeb::sendChunk("<a href='");
    _sendAttrEscaped(path);
    Esp8266BaseWeb::sendChunk("'");
    if (cls && cls[0]) {
        Esp8266BaseWeb::sendChunk(" class='");
        _sendAttrEscaped(cls);
        Esp8266BaseWeb::sendChunk("'");
    }
    Esp8266BaseWeb::sendChunk(">");
    _sendAttrEscaped(title);
    Esp8266BaseWeb::sendChunk("</a>");
}

#if !ESP8266BASE_PROFILE_MQTT_TERMINAL
const char* Esp8266BaseWeb::_brandTitle() {
    return _deviceName[0] ? _deviceName : _titleBuf;
}

const char* Esp8266BaseWeb::_brandHref() {
    return _homePath[0] ? _homePath : "/";
}

void Esp8266BaseWeb::_sendSystemLinks() {
    const char* systemHome = "/";
    if (_homeMode == Esp8266BaseWebHomeMode::APP_HOME_FIRST && _homePath[0]) {
        systemHome = _homePath;
    } else if (_homeMode == Esp8266BaseWebHomeMode::FUSED_HOME && _homePath[0]) {
        systemHome = "/esp8266base";
    }
    _sendLink(systemHome, _builtinLabel(Esp8266BaseWebBuiltinLabel::HOME), nullptr);
#if ESP8266BASE_USE_FILELOG
    _sendLink("/logs", _builtinLabel(Esp8266BaseWebBuiltinLabel::LOGS), nullptr);
#endif
    _sendLink("/system", _builtinLabel(Esp8266BaseWebBuiltinLabel::SYSTEM), nullptr);
}
#endif

void Esp8266BaseWeb::_sendAppLinks() {
#if ESP8266BASE_WEB_MAX_APP_PAGES > 0
    for (uint8_t i = 0; i < _pageCount; i++) {
        if (!_pages[i].showInNav) continue;
        _sendLink(_pages[i].path, _pages[i].title, nullptr);
    }
#endif
}

void Esp8266BaseWeb::_sendFormToken() {
    char field[64];
    snprintf(field, sizeof(field),
             "<input type=hidden name=csrf value='%lu'>",
             static_cast<unsigned long>(_formToken));
    sendChunk(field);
}

bool Esp8266BaseWeb::_verifyFormToken() {
    const String raw = _server.arg("csrf");
    char* end = nullptr;
    const unsigned long value = strtoul(raw.c_str(), &end, 10);
    if (raw.length() > 0 && end && *end == '\0' && value == _formToken) return true;
    ESP8266BASE_LOG_W("Web ", "form_rejected reason=invalid_csrf_token");
    _server.send(403, "text/plain", "invalid form token");
    return false;
}

// ----------------------------------------------------------------------------
// 公开 API
// ----------------------------------------------------------------------------
bool Esp8266BaseWeb::begin() {
    if (_running) return true;

    _formToken = ESP.random();
    if (_formToken == 0) _formToken = 1;
    _loadPersistedAuth();

    // 注册内置路由（静态成员函数指针，无捕获，无 std::function 对象驻留堆）
#if !ESP8266BASE_PROFILE_MQTT_TERMINAL
    _server.on("/wifi",   HTTP_GET,  _handleWiFiGet);
    _server.on("/wifi",   HTTP_POST, _handleWiFiPost);
    _server.on("/auth",   HTTP_GET,  _handleAuthGet);
    _server.on("/auth",   HTTP_POST, _handleAuthPost);
#endif
#if ESP8266BASE_USE_OTA && !ESP8266BASE_PROFILE_MQTT_TERMINAL
    _server.on("/ota",    HTTP_GET,  _handleOtaGet);
    // POST /ota 由 Esp8266BaseOTA::begin() 注册（需要 upload handler）
#endif
#if !ESP8266BASE_PROFILE_MQTT_TERMINAL
    _server.on("/",       HTTP_GET,  _handleRoot);
    _server.on("/esp8266base", HTTP_GET, _handleSystemHome);
#if ESP8266BASE_USE_FILELOG
    _server.on("/logs",   HTTP_GET,  _handleLogsGet);
    _server.on("/logs/clear", HTTP_POST, _handleLogsClearPost);
#endif
    _server.on("/system", HTTP_GET,  _handleSystemGet);
#if ESP8266BASE_USE_FILELOG
    _server.on("/system/filelog", HTTP_POST, _handleFileLogPost);
#endif
    _server.on("/system/hostname", HTTP_POST, _handleHostnamePost);
    _server.on("/api/system/hostname", HTTP_GET, _handleHostnameApiGet);
    _server.on("/api/system/hostname", HTTP_POST, _handleHostnameApiPost);
    _server.on("/reboot", HTTP_POST, _handleRebootPost);
#endif
#if !ESP8266BASE_PROFILE_MQTT_TERMINAL
    _server.on("/health", HTTP_GET,  _handleHealth);
    _server.onNotFound(_handleNotFound);
#else
    // Terminal 用一个固定 dispatcher 承担所有基础 GET/POST 路由；仅 multipart
    // OTA 仍需 ESP8266WebServer 的独立 upload handler。
    _server.onNotFound(_handleTerminalDispatch);
#endif

    _server.addHook(_heapGateHook);
    // ESP8266WebServer::begin() uses the Core default backlog of five. On this
    // constrained target those peers allocate ClientContext in SDK context,
    // before _heapGateHook can reject safely. Start the owned WiFiServer with
    // the bounded backlog directly; WebServer routing/handling is unchanged.
    _server.close();  // resets request state and collects Authorization header
    _server.getServer().begin(80, ESP8266BASE_WEB_TCP_BACKLOG);
    _running = true;
    ESP8266BASE_LOG_I_P("Web ", "web_listener backlog=%u",
                      static_cast<unsigned>(ESP8266BASE_WEB_TCP_BACKLOG));
    ESP8266BASE_LOG_I("Web ", "web_server_started profile=%s auth_required=yes builtin_routes=%u app_pages_registered=%d/%d app_apis_registered=%d/%d",
#if ESP8266BASE_PROFILE_MQTT_TERMINAL
                      "mqtt_terminal", 6U,
#else
                      "full", (unsigned)(15 + (ESP8266BASE_USE_OTA ? 1 : 0)),
#endif
#if ESP8266BASE_WEB_MAX_APP_PAGES > 0
                      (int)_pageCount,
#else
                      0,
#endif
                      ESP8266BASE_WEB_MAX_APP_PAGES,
#if ESP8266BASE_WEB_MAX_APP_APIS > 0
                      (int)_apiCount,
#else
                      0,
#endif
                      ESP8266BASE_WEB_MAX_APP_APIS);
    return true;
}

void Esp8266BaseWeb::handle() {
    if (!_running) return;
    _activeUri[0] = '\0';
    _activeMethod[0] = '\0';
    uint32_t start = millis();
    _server.handleClient();
    uint32_t elapsed = millis() - start;
    if (elapsed > 250UL) {
#if ESP8266BASE_LOG_LEVEL <= 0
        const char* method = _activeMethod[0] ? _activeMethod : "?";
        const char* uri = _activeUri[0] ? _activeUri : "(unknown)";
        ESP8266BASE_LOG_D("Web ", "slow_request method=%s uri=%s elapsed=%lums",
                          method, uri, (unsigned long)elapsed);
#endif
    }
}

