tangyangguang/Esp8266Base/src/Esp8266BaseWeb.cpp
bool Esp8266BaseWeb::isRunning() {
    return _running;
}

bool Esp8266BaseWeb::addPage(const char* path, const char* title, Esp8266BaseWebHandler handler) {
#if ESP8266BASE_WEB_MAX_APP_PAGES == 0
    (void)title;
    (void)handler;
    ESP8266BASE_LOG_W("Web ", "addPage_rejected reason=capacity_disabled path=%s", path ? path : "(null)");
    return false;
#else
    if (!path || !handler) return false;
    if (!_running) {
        ESP8266BASE_LOG_W("Web ", "addPage_rejected reason=web_not_running path=%s", path);
        return false;
    }
    if (!_isValidPath(path)) {
        ESP8266BASE_LOG_W("Web ", "addPage_rejected reason=invalid_path path=%s count=%u max=%u",
                          path, (unsigned)_pageCount, (unsigned)ESP8266BASE_WEB_MAX_APP_PAGES);
        return false;
    }
    if (_pageCount >= ESP8266BASE_WEB_MAX_APP_PAGES) {
        ESP8266BASE_LOG_W("Web ", "addPage_rejected reason=table_full path=%s count=%u max=%u",
                          path, (unsigned)_pageCount, (unsigned)ESP8266BASE_WEB_MAX_APP_PAGES);
        return false;
    }

    strncpy(_pages[_pageCount].path, path, 23);
    _pages[_pageCount].path[23]    = '\0';
    if (title && title[0]) {
        strncpy(_pages[_pageCount].title, title, sizeof(_pages[_pageCount].title) - 1);
    } else {
        strncpy(_pages[_pageCount].title, path + 1, sizeof(_pages[_pageCount].title) - 1);
    }
    _pages[_pageCount].title[sizeof(_pages[_pageCount].title) - 1] = '\0';
    _pages[_pageCount].handler     = handler;
    _pages[_pageCount].isApi       = false;
    _pages[_pageCount].showInNav   = true;
    uint8_t index = _pageCount;
    _pageCount++;

    switch (index) {
        case 0: _server.on(path, HTTP_GET, _handleAppPage0); break;
        case 1: _server.on(path, HTTP_GET, _handleAppPage1); break;
        case 2: _server.on(path, HTTP_GET, _handleAppPage2); break;
        case 3: _server.on(path, HTTP_GET, _handleAppPage3); break;
        default: return false;
    }
    ESP8266BASE_LOG_I("Web ", "app_page_registered path=%s title=%s app_pages_registered=%d/%d",
                      path, _pages[index].title, (int)_pageCount, ESP8266BASE_WEB_MAX_APP_PAGES);
    return true;
#endif
}

bool Esp8266BaseWeb::addApi(const char* path, Esp8266BaseWebHandler handler) {
#if ESP8266BASE_WEB_MAX_APP_APIS == 0
    (void)handler;
    ESP8266BASE_LOG_W("Web ", "addApi_rejected reason=capacity_disabled path=%s", path ? path : "(null)");
    return false;
#else
    if (!path || !handler) return false;
    if (!_running) {
        ESP8266BASE_LOG_W("Web ", "addApi_rejected reason=web_not_running path=%s", path);
        return false;
    }
    if (!_isValidPath(path)) {
        ESP8266BASE_LOG_W("Web ", "addApi_rejected reason=invalid_path path=%s count=%u max=%u",
                          path, (unsigned)_apiCount, (unsigned)ESP8266BASE_WEB_MAX_APP_APIS);
        return false;
    }
    if (_apiCount >= ESP8266BASE_WEB_MAX_APP_APIS) {
        ESP8266BASE_LOG_W("Web ", "addApi_rejected reason=table_full path=%s count=%u max=%u",
                          path, (unsigned)_apiCount, (unsigned)ESP8266BASE_WEB_MAX_APP_APIS);
        return false;
    }

    strncpy(_apis[_apiCount].path, path, 23);
    _apis[_apiCount].path[23]    = '\0';
    _apis[_apiCount].title[0]    = '\0';
    _apis[_apiCount].handler     = handler;
    _apis[_apiCount].isApi       = true;
    _apis[_apiCount].showInNav   = false;
    uint8_t index = _apiCount;
    _apiCount++;

    switch (index) {
        case 0: _server.on(path, _handleAppApi0); break;
        case 1: _server.on(path, _handleAppApi1); break;
        case 2: _server.on(path, _handleAppApi2); break;
        case 3: _server.on(path, _handleAppApi3); break;
        case 4: _server.on(path, _handleAppApi4); break;
        case 5: _server.on(path, _handleAppApi5); break;
        default: return false;
    }
    ESP8266BASE_LOG_I("Web ", "app_api_registered path=%s app_apis_registered=%d/%d",
                      path, (int)_apiCount, ESP8266BASE_WEB_MAX_APP_APIS);
    return true;
#endif
}

void Esp8266BaseWeb::setDeviceName(const char* name) {
    if (!name) return;
    strncpy(_deviceName, name, sizeof(_deviceName) - 1);
    _deviceName[sizeof(_deviceName) - 1] = '\0';
}

void Esp8266BaseWeb::setHomePath(const char* path) {
#if ESP8266BASE_PROFILE_MQTT_TERMINAL
    (void)path;
#else
    if (!_isValidPath(path)) return;
    strncpy(_homePath, path, sizeof(_homePath) - 1);
    _homePath[sizeof(_homePath) - 1] = '\0';
#endif
}

void Esp8266BaseWeb::setHomeMode(Esp8266BaseWebHomeMode mode) {
#if ESP8266BASE_PROFILE_MQTT_TERMINAL
    (void)mode;
#else
    _homeMode = mode;
#endif
}

void Esp8266BaseWeb::setSystemNavMode(Esp8266BaseWebSystemNavMode mode) {
#if ESP8266BASE_PROFILE_MQTT_TERMINAL
    (void)mode;
#else
    _systemNavMode = mode;
#endif
}

void Esp8266BaseWeb::setBuiltinLabel(Esp8266BaseWebBuiltinLabel label, const char* title) {
#if ESP8266BASE_PROFILE_MQTT_TERMINAL
    (void)label;
    (void)title;
#else
    if (!title) return;
    uint8_t index = (uint8_t)label;
    if (index >= 3) return;
    strncpy(_builtinLabels[index], title, sizeof(_builtinLabels[index]) - 1);
    _builtinLabels[index][sizeof(_builtinLabels[index]) - 1] = '\0';
#endif
}

void Esp8266BaseWeb::setDefaultAuth(const char* user, const char* pass) {
    if (_running) {
        ESP8266BASE_LOG_W("Web ", "set_default_auth_ignored reason=web_already_running");
        return;
    }
    if (user) { strncpy(_authUser, user, 23); _authUser[23] = '\0'; }
    if (pass) { strncpy(_authPass, pass, 23); _authPass[23] = '\0'; }
}

void Esp8266BaseWeb::setSystemInfo(const char* hostname, const char* fw, const char* ver, uint32_t bootCount) {
    if (hostname) {
        strncpy(_hostname, hostname, sizeof(_hostname) - 1);
        _hostname[sizeof(_hostname) - 1] = '\0';
    }
    if (fw) {
        strncpy(_fwName, fw, sizeof(_fwName) - 1);
        _fwName[sizeof(_fwName) - 1] = '\0';
    }
    if (ver) {
        strncpy(_fwVersion, ver, sizeof(_fwVersion) - 1);
        _fwVersion[sizeof(_fwVersion) - 1] = '\0';
    }
#if ESP8266BASE_PROFILE_MQTT_TERMINAL
    (void)bootCount;
#else
    _bootCount = bootCount;
    strncpy(_titleBuf, _hostname, sizeof(_titleBuf) - 1);
    _titleBuf[sizeof(_titleBuf) - 1] = '\0';
    strncat(_titleBuf, " (", sizeof(_titleBuf) - strlen(_titleBuf) - 1);
    strncat(_titleBuf, _fwName, sizeof(_titleBuf) - strlen(_titleBuf) - 1);
    strncat(_titleBuf, " ", sizeof(_titleBuf) - strlen(_titleBuf) - 1);
    strncat(_titleBuf, _fwVersion, sizeof(_titleBuf) - strlen(_titleBuf) - 1);
    strncat(_titleBuf, ")", sizeof(_titleBuf) - strlen(_titleBuf) - 1);
#endif
}

