tangyangguang/Esp8266Base/src/Esp8266BaseWeb.cpp
ESP8266WebServer& Esp8266BaseWeb::server() {
    return _server;
}

// ----------------------------------------------------------------------------
// Auth
// ----------------------------------------------------------------------------
bool Esp8266BaseWeb::checkAuth() {
    if (_server.authenticate(_authUser, _authPass)) return true;
    _server.requestAuthentication();
    return false;
}

ESP8266WebServer::ClientFuture Esp8266BaseWeb::_heapGateHook(
    const String&, const String&, WiFiClient* client,
    ESP8266WebServer::ContentTypeFunction) {
    _lastActivityMs = millis();
    if (client) {
        // Web replies are small and latency-insensitive. Sync mode waits for each
        // write to be acknowledged instead of retaining temporary TCP send-copy
        // memory alongside MQTT/TLS and an accepted peer. This keeps the heap
        // gate effective throughout streamed responses, not only at request start.
        client->setSync(true);
    }
    const uint32_t freeHeap = ESP.getFreeHeap();
    const uint32_t maxBlock = ESP.getMaxFreeBlockSize();
    if (freeHeap >= ESP8266BASE_WEB_HEAP_GATE_FREE_BYTES &&
        maxBlock >= ESP8266BASE_WEB_HEAP_GATE_BLOCK_BYTES) {
        return ESP8266WebServer::CLIENT_REQUEST_CAN_CONTINUE;
    }
    ESP8266BASE_LOG_W("Web", "heap_gate_reject free_heap=%u max_block=%u action=503",
                      (unsigned)freeHeap, (unsigned)maxBlock);
    if (client) {
        // 预解析阶段：直接写最小响应后要求关闭连接，不进入请求头解析。
        client->print(F("HTTP/1.1 503 Service Unavailable\r\n"
                        "Content-Type: text/plain\r\n"
                        "Content-Length: 10\r\n"
                        "Connection: close\r\n"
                        "Cache-Control: no-store\r\n\r\nbusy retry"));
        client->flush();
    }
    return ESP8266WebServer::CLIENT_MUST_STOP;
}

uint32_t Esp8266BaseWeb::lastActivityMs() {
    return _lastActivityMs;
}

bool Esp8266BaseWeb::verifyAuth() {
    return _server.authenticate(_authUser, _authPass);
}

void Esp8266BaseWeb::_loadPersistedAuth() {
    char pass[24] = "";
    bool passFound = false;
#if ESP8266BASE_USE_WEB_AUTH_CONFIG
    if (Esp8266BaseConfig::isReady()) {
        passFound = Esp8266BaseConfig::getStr(ESP8266BASE_CFG_KEY_WEB_PASS, pass, sizeof(pass), "");
    }
#endif
    if (passFound && pass[0]) {
        strncpy(_authPass, pass, sizeof(_authPass) - 1);
        _authPass[sizeof(_authPass) - 1] = '\0';
    }
    ESP8266BASE_LOG_I("Web ", "web_auth_loaded user=%s password=[redacted] pass_source=%s password_length=%u",
                      _authUser, (passFound && pass[0]) ? "persisted" : "default",
                      (unsigned)strlen(_authPass));
}

void Esp8266BaseWeb::_formatDuration(uint32_t seconds, char* out, size_t len) {
    if (!out || len == 0) return;
    uint32_t days = seconds / 86400UL;
    seconds %= 86400UL;
    uint32_t hours = seconds / 3600UL;
    seconds %= 3600UL;
    uint32_t minutes = seconds / 60UL;
    seconds %= 60UL;
    if (days > 0) {
        snprintf(out, len, "%lud %luh %lum %lus",
                 (unsigned long)days, (unsigned long)hours,
                 (unsigned long)minutes, (unsigned long)seconds);
    } else if (hours > 0) {
        snprintf(out, len, "%luh %lum %lus",
                 (unsigned long)hours, (unsigned long)minutes, (unsigned long)seconds);
    } else if (minutes > 0) {
        snprintf(out, len, "%lum %lus", (unsigned long)minutes, (unsigned long)seconds);
    } else {
        snprintf(out, len, "%lus", (unsigned long)seconds);
    }
}

void Esp8266BaseWeb::_formatFooterUptime(uint32_t seconds, char* out, size_t len) {
    if (!out || len == 0) return;
    uint32_t days = seconds / 86400UL;
    seconds %= 86400UL;
    uint32_t hours = seconds / 3600UL;
    seconds %= 3600UL;
    uint32_t minutes = seconds / 60UL;
    if (days > 0) {
        snprintf(out, len, "%lud %luh", (unsigned long)days, (unsigned long)hours);
    } else if (hours > 0) {
        snprintf(out, len, "%luh %lum", (unsigned long)hours, (unsigned long)minutes);
    } else {
        snprintf(out, len, "%lum", (unsigned long)minutes);
    }
}

void Esp8266BaseWeb::_sendKv(const char* key, const char* value) {
    sendChunk("<dt>");
    _sendAttrEscaped(key);
    sendChunk("</dt><dd>");
    _sendAttrEscaped(value && value[0] ? value : "-");
    sendChunk("</dd>");
}

void Esp8266BaseWeb::_sendIconResponse() {
    _server.keepAlive(false);
    _server.client().setNoDelay(true);
    // A 204 has no body or Content-Length. Reuse the bounded, partial-write
    // aware Flash sender rather than Core send()'s temporary header String.
    sendContent_P(PSTR("HTTP/1.1 204 No Content\r\nConnection: close\r\n\r\n"));
    _server.client().stop();
}

void Esp8266BaseWeb::_markRequest() {
    strncpy(_activeMethod, (_server.method() == HTTP_POST) ? "POST" : "GET",
            sizeof(_activeMethod) - 1);
    _activeMethod[sizeof(_activeMethod) - 1] = '\0';

    strncpy(_activeUri, _server.uri().c_str(), sizeof(_activeUri) - 1);
    _activeUri[sizeof(_activeUri) - 1] = '\0';
}

void Esp8266BaseWeb::_handleAppPage(uint8_t index) {
    _markRequest();
#if ESP8266BASE_WEB_MAX_APP_PAGES > 0
    if (index < _pageCount && _pages[index].handler) {
        _pages[index].handler();
    } else {
        _server.send(404, "text/plain", "Page route not found");
    }
#else
    (void)index;
    _server.send(404, "text/plain", "Page routes disabled");
#endif
}

void Esp8266BaseWeb::_handleAppApi(uint8_t index) {
    _markRequest();
#if ESP8266BASE_WEB_MAX_APP_APIS > 0
    if (index < _apiCount && _apis[index].handler) {
        _apis[index].handler();
    } else {
        _server.send(404, "text/plain", "API route not found");
    }
#else
    (void)index;
    _server.send(404, "text/plain", "API routes disabled");
#endif
}

void Esp8266BaseWeb::_handleAppPage0() { _handleAppPage(0); }
void Esp8266BaseWeb::_handleAppPage1() { _handleAppPage(1); }
void Esp8266BaseWeb::_handleAppPage2() { _handleAppPage(2); }
void Esp8266BaseWeb::_handleAppPage3() { _handleAppPage(3); }
void Esp8266BaseWeb::_handleAppApi0()  { _handleAppApi(0); }
void Esp8266BaseWeb::_handleAppApi1()  { _handleAppApi(1); }
void Esp8266BaseWeb::_handleAppApi2()  { _handleAppApi(2); }
void Esp8266BaseWeb::_handleAppApi3()  { _handleAppApi(3); }
void Esp8266BaseWeb::_handleAppApi4()  { _handleAppApi(4); }
void Esp8266BaseWeb::_handleAppApi5()  { _handleAppApi(5); }

// ----------------------------------------------------------------------------
// 分段发送辅助
// ----------------------------------------------------------------------------
void Esp8266BaseWeb::sendHeader() {
    _markRequest();
    WiFiClient& client = _server.client();
    client.setNoDelay(true);
    client.setTimeout(1500);
    sendContent_P(PSTR("HTTP/1.1 200 OK\r\n"
                   "Content-Type: text/html; charset=utf-8\r\n"
                   "Connection: close\r\n"
                   "Cache-Control: no-store\r\n\r\n"));
    sendChunk("<!DOCTYPE html><html><head><title>");
#if ESP8266BASE_PROFILE_MQTT_TERMINAL
    _sendAttrEscaped(_deviceName[0] ? _deviceName : _fwName);
#else
    _sendAttrEscaped(_titleBuf);
#endif
    sendChunk("</title>");
    sendContent_P(WEB_HEAD);
#if !ESP8266BASE_PROFILE_MQTT_TERMINAL
    _sendLink(_brandHref(), _brandTitle(), "brand");
#endif
    _sendAppLinks();
#if !ESP8266BASE_PROFILE_MQTT_TERMINAL
    if (_systemNavMode == Esp8266BaseWebSystemNavMode::TOP_NAV) {
        _sendSystemLinks();
    }
#endif
    sendContent_P(WEB_NAV_END);
}

void Esp8266BaseWeb::sendFooter() {
#if ESP8266BASE_PROFILE_MQTT_TERMINAL
    sendChunk("<footer>Free heap: ");
    char heap[16];
    Esp8266BaseUtil::formatBytes(ESP.getFreeHeap(), heap, sizeof(heap));
    sendChunk(heap);
    sendChunk("</footer></body></html>");
#else
    if (_systemNavMode == Esp8266BaseWebSystemNavMode::BOTTOM_NAV) {
        sendChunk("<div class=sysnav>");
        _sendSystemLinks();
        sendChunk("</div>");
    }
    sendContent_P(WEB_FOOT_PRE);
    if (_systemNavMode == Esp8266BaseWebSystemNavMode::FOOTER_COMPACT) {
        sendChunk("<span class=tools>");
        _sendSystemLinks();
        sendChunk("</span>");
    }
    char uptime[16];
    _formatFooterUptime(millis() / 1000UL, uptime, sizeof(uptime));
    char rssi[12] = "-";
    if (Esp8266BaseWiFi::isConnected()) {
        snprintf(rssi, sizeof(rssi), "%d dBm", Esp8266BaseWiFi::rssi());
    }
    sendContent_P(WEB_FOOT_HEAP_PRE);
    char heap[16];
    Esp8266BaseUtil::formatBytes(ESP.getFreeHeap(), heap, sizeof(heap));
    sendChunk(heap);
    sendContent_P(WEB_FOOT_UP_PRE);
    sendChunk(uptime);
    sendContent_P(WEB_FOOT_RSSI_PRE);
    sendChunk(rssi);
    sendContent_P(WEB_FOOT_POST);
#endif
    _server.client().flush();
    _server.client().stop();
    yield();
}

// Whole API-call budget; keep the 1500ms SDK write timeout separate.
// A page may require many acknowledged small writes over normal WiFi.
static bool _writeWebBytes(WiFiClient& client, const uint8_t* data,
                           size_t length, uint32_t startedMs) {
    const bool ok = Esp8266BaseInternal::writeAll(
        client, data, length, startedMs, 30000UL,
        []() { return millis(); }, []() { yield(); });
    if (!ok) client.stop();
    return ok;
}

