tangyangguang/Esp8266Base/src/Esp8266BaseWeb.cpp
struct WebJsonOutput {
    WiFiClient& client;
    uint32_t startedMs;
};
static bool _writeWebJson(const uint8_t* data, size_t length, void* context) {
    auto& output = *static_cast<WebJsonOutput*>(context);
    return _writeWebBytes(output.client, data, length, output.startedMs);
}

void Esp8266BaseWeb::sendContent_P(PGM_P content) {
    if (!content || !_server.client().connected()) return;
    const uint32_t startedMs = millis();
    // One pass over PROGMEM, one timeout budget for this string.
    char buf[96];
    size_t chunk = 0;
    uint8_t c;
    while ((c = pgm_read_byte(content++)) != 0) {
        buf[chunk++] = static_cast<char>(c);
        if (chunk == sizeof(buf) - 1) {
            if (!_writeWebBytes(_server.client(), reinterpret_cast<const uint8_t*>(buf), chunk, startedMs)) return;
            chunk = 0;
        }
    }
    if (chunk > 0) {
        _writeWebBytes(_server.client(), reinterpret_cast<const uint8_t*>(buf), chunk, startedMs);
    }
}

void Esp8266BaseWeb::sendChunk(const char* content) {
    if (content) {
        _writeWebBytes(_server.client(), reinterpret_cast<const uint8_t*>(content), strlen(content), millis());
    }
}

// ----------------------------------------------------------------------------
// 内置路由处理函数
// ----------------------------------------------------------------------------
#if !ESP8266BASE_PROFILE_MQTT_TERMINAL
void Esp8266BaseWeb::_handleRoot() {
    _markRequest();
    if (_homePath[0] && _homeMode != Esp8266BaseWebHomeMode::DEFAULT_SYSTEM_HOME) {
        _redirect(_homePath);
        return;
    }
    _handleSystemHome();
}

void Esp8266BaseWeb::_handleSystemHome() {
    _markRequest();
    if (_homePath[0] && _homeMode == Esp8266BaseWebHomeMode::APP_HOME_FIRST) {
        _redirect(_homePath);
        return;
    }
    if (!checkAuth()) return;
    sendHeader();
    sendChunk("<h2>");
    _sendAttrEscaped(_brandTitle());
    sendChunk("</h2>");

    const char* wifiState = "Connecting";
    const char* ssid = Esp8266BaseWiFi::ssid();
    const char* ip = "-";
    char rssi[12] = "-";
    char mac[18] = "";
    Esp8266BaseWiFi::macAddressTo(mac, sizeof(mac));
    if (Esp8266BaseWiFi::isConnected()) {
        wifiState = "Connected";
        ip = Esp8266BaseWiFi::ip();
        snprintf(rssi, sizeof(rssi), "%d dBm", Esp8266BaseWiFi::rssi());
    } else if (Esp8266BaseWiFi::state() == Esp8266BaseWiFiState::AP_CONFIG) {
        wifiState = "AP Mode";
        ssid = Esp8266BaseWiFi::apSSID();
        ip = "192.168.4.1";
    }

    char bootCount[12];
    snprintf(bootCount, sizeof(bootCount), "%lu", (unsigned long)_bootCount);

    char chipId[18];
    snprintf(chipId, sizeof(chipId), "ESP8266-%06X", (unsigned)(ESP.getChipId() & 0xFFFFFFUL));

    char cpuFreq[12];
    snprintf(cpuFreq, sizeof(cpuFreq), "%u MHz", (unsigned)ESP.getCpuFreqMHz());

    char flashSize[16];
    Esp8266BaseUtil::formatBytes(ESP.getFlashChipRealSize(), flashSize, sizeof(flashSize));

    char sketchSize[16];
    Esp8266BaseUtil::formatBytes(ESP.getSketchSize(), sketchSize, sizeof(sketchSize));

    char otaFree[16];
    Esp8266BaseUtil::formatBytes(ESP.getFreeSketchSpace(), otaFree, sizeof(otaFree));

    char freeHeap[16];
    Esp8266BaseUtil::formatBytes(ESP.getFreeHeap(), freeHeap, sizeof(freeHeap));

    char maxBlock[16];
    Esp8266BaseUtil::formatBytes(ESP.getMaxFreeBlockSize(), maxBlock, sizeof(maxBlock));

    char uptime[32];
    _formatDuration(millis() / 1000UL, uptime, sizeof(uptime));

    char ntpState[12] = "disabled";
    char currentTime[20] = "-";
    char bootTime[20] = "-";
#if ESP8266BASE_USE_NTP
    if (Esp8266BaseNTP::isSynced()) {
        strncpy(ntpState, "synced", sizeof(ntpState) - 1);
        Esp8266BaseNTP::formatTo(currentTime, sizeof(currentTime), "%Y-%m-%d %H:%M:%S");
        time_t bt = time(nullptr) - (time_t)(millis() / 1000UL);
        struct tm* tm_info = localtime(&bt);
        if (tm_info) {
            strftime(bootTime, sizeof(bootTime), "%Y-%m-%d %H:%M:%S", tm_info);
        }
    } else {
        strncpy(ntpState, "pending", sizeof(ntpState) - 1);
    }
#endif

    sendChunk("<div class=grid><section><h3>Connection</h3><dl>");
    _sendKv("Hostname", _hostname);
    _sendKv("WiFi", wifiState);
    _sendKv("SSID", ssid);
    _sendKv("IP", ip);
    _sendKv("RSSI", rssi);
    _sendKv("STA MAC", mac);
    sendChunk("</dl></section><section><h3>Runtime</h3><dl>");
    _sendKv("Free heap", freeHeap);
    _sendKv("Max block", maxBlock);
    _sendKv("Restart count", bootCount);
#if ESP8266BASE_USE_WATCHDOG
    char wdtResets[28];
    snprintf(wdtResets, sizeof(wdtResets), "%lu since clear",
             (unsigned long)Esp8266BaseWatchdog::resetCount());
    _sendKv("WDT resets", wdtResets);
#endif
#if ESP8266BASE_USE_SLEEP
    _sendKv("Wake reason", _wakeReasonText(Esp8266BaseSleep::wakeReason()));
#endif
    sendChunk("</dl></section><section><h3>Firmware</h3><dl>");
    _sendKv("Firmware", _fwName);
    _sendKv("Version", _fwVersion);
    _sendKv("Chip ID", chipId);
    _sendKv("CPU", cpuFreq);
    _sendKv("Flash", flashSize);
    _sendKv("Sketch", sketchSize);
    _sendKv("OTA free", otaFree);
    sendChunk("</dl></section><section><h3>Time</h3><dl>");
    _sendKv("Uptime", uptime);
    _sendKv("NTP", ntpState);
    _sendKv("Now", currentTime);
    _sendKv("Boot time", bootTime);
    sendChunk("</dl></section></div>");
    sendFooter();
}
#endif

void Esp8266BaseWeb::_handleWiFiGet() {
    if (!checkAuth()) return;
    sendHeader();
    if (_server.hasArg("saved")) {
        sendChunk("<p class=ok>Saved. Credentials updated and connection started.</p>");
    } else if (_server.hasArg("error")) {
        char err[24] = "";
        strncpy(err, _server.arg("error").c_str(), sizeof(err) - 1);
        if (strcmp(err, "missing_ssid") == 0) {
            sendChunk("<p class=err>SSID cannot be empty.</p>");
        } else if (strcmp(err, "ssid_too_long") == 0) {
            sendChunk("<p class=err>SSID is too long. Maximum is 32 bytes.</p>");
        } else if (strcmp(err, "password_too_long") == 0) {
            sendChunk("<p class=err>Password is too long. Maximum is 63 bytes.</p>");
        } else if (strcmp(err, "save_failed") == 0) {
            sendChunk("<p class=err>Failed to save WiFi credentials.</p>");
        } else {
            sendChunk("<p class=err>WiFi settings were not saved.</p>");
        }
    }

    char ssid[64] = "";
#if ESP8266BASE_USE_WIFI_CONFIG
    Esp8266BaseConfig::getStr(ESP8266BASE_CFG_KEY_WIFI_SSID, ssid, sizeof(ssid), "");
#else
    strncpy(ssid, Esp8266BaseWiFi::ssid(), sizeof(ssid) - 1);
#endif
    sendContent_P(WEB_WIFI_FORM_PRE);
    _sendFormToken();
    sendContent_P(WEB_WIFI_FORM_SSID);
    _sendAttrEscaped(ssid);
    sendContent_P(WEB_WIFI_FORM_MID);
    // Never echo the persisted secret into HTML. Saving this form requires the
    // operator to enter the password again (or leave it empty for an open AP).
    sendContent_P(WEB_WIFI_FORM_POST);
    sendFooter();
}

void Esp8266BaseWeb::_handleWiFiPost() {
    if (!checkAuth()) return;
    _markRequest();
    if (!_verifyFormToken()) return;

    String ssidArg = _server.arg("ssid");
    String passArg = _server.arg("pass");

    if (ssidArg.length() == 0) {
        _redirect("/wifi?error=missing_ssid");
        return;
    }
    if (ssidArg.length() > 32) {
        ESP8266BASE_LOG_W("Web ", "wifi_credentials_form_rejected reason=ssid_too_long length=%u max=32",
                          (unsigned)ssidArg.length());
        _redirect("/wifi?error=ssid_too_long");
        return;
    }
    if (passArg.length() > 63) {
        ESP8266BASE_LOG_W("Web ", "wifi_credentials_form_rejected reason=password_too_long length=%u max=63",
                          (unsigned)passArg.length());
        _redirect("/wifi?error=password_too_long");
        return;
    }

