tangyangguang/Esp8266Base/src/Esp8266BaseWeb.cpp
    ESP8266BASE_LOG_I("Web ", "wifi_credentials_form_submitted ssid=%s password=[redacted] password_length=%u",
                      ssidArg.c_str(), (unsigned)passArg.length());
    if (Esp8266BaseWiFi::connect(ssidArg.c_str(), passArg.c_str())) {
        _redirect("/wifi?saved=1");
    } else {
        _redirect("/wifi?error=save_failed");
    }
}

void Esp8266BaseWeb::_handleAuthGet() {
    if (!checkAuth()) return;
    sendHeader();
    if (_server.hasArg("saved")) {
        sendChunk("<p class=ok>Password saved. Use the new password for the next request.</p>");
    } else if (_server.hasArg("error")) {
        char err[24] = "";
        strncpy(err, _server.arg("error").c_str(), sizeof(err) - 1);
        if (strcmp(err, "current") == 0) {
            sendChunk("<p class=err>Current password is incorrect.</p>");
        } else if (strcmp(err, "empty") == 0) {
            sendChunk("<p class=err>New password cannot be empty.</p>");
        } else if (strcmp(err, "too_long") == 0) {
            sendChunk("<p class=err>New password is too long. Maximum length is 23.</p>");
        } else if (strcmp(err, "mismatch") == 0) {
            sendChunk("<p class=err>New password and confirmation do not match.</p>");
        } else if (strcmp(err, "save_failed") == 0) {
            sendChunk("<p class=err>Failed to save password.</p>");
        } else {
            sendChunk("<p class=err>Password was not saved.</p>");
        }
    }
    sendContent_P(WEB_AUTH_FORM_PRE);
    _sendFormToken();
    sendContent_P(WEB_AUTH_FORM_FIELDS);
    sendFooter();
}

void Esp8266BaseWeb::_handleAuthPost() {
    if (!checkAuth()) return;
    _markRequest();
    if (!_verifyFormToken()) return;

    const String currentArg = _server.arg("current");
    const String newArg = _server.arg("newpass");
    const String confirmArg = _server.arg("confirm");

    if (newArg.length() == 0) {
        ESP8266BASE_LOG_W("Web ", "web_password_change_rejected reason=empty");
        _redirect("/auth?error=empty");
        return;
    }
    if (newArg.length() > 23 || currentArg.length() > 23 || confirmArg.length() > 23) {
        ESP8266BASE_LOG_W("Web ", "web_password_change_rejected reason=too_long current_length=%u new_length=%u confirm_length=%u",
                          (unsigned)currentArg.length(), (unsigned)newArg.length(), (unsigned)confirmArg.length());
        _redirect("/auth?error=too_long");
        return;
    }

    char current[24] = "";
    char newPass[24] = "";
    char confirm[24] = "";
    strncpy(current, currentArg.c_str(), sizeof(current) - 1);
    strncpy(newPass, newArg.c_str(), sizeof(newPass) - 1);
    strncpy(confirm, confirmArg.c_str(), sizeof(confirm) - 1);

    if (strcmp(current, _authPass) != 0) {
        ESP8266BASE_LOG_W("Web ", "web_password_change_rejected reason=current_password_mismatch current=[redacted] expected=[redacted]");
        _redirect("/auth?error=current");
        return;
    }
    if (strcmp(newPass, confirm) != 0) {
        ESP8266BASE_LOG_W("Web ", "web_password_change_rejected reason=mismatch new=[redacted] confirm=[redacted]");
        _redirect("/auth?error=mismatch");
        return;
    }

#if ESP8266BASE_USE_WEB_AUTH_CONFIG
    if (!Esp8266BaseConfig::setStr(ESP8266BASE_CFG_KEY_WEB_PASS, newPass)) {
        ESP8266BASE_LOG_E("Web ", "web_password_update_failed password=[redacted] password_length=%u",
                          (unsigned)strlen(newPass));
        _redirect("/auth?error=save_failed");
        return;
    }
#endif

    strncpy(_authPass, newPass, sizeof(_authPass) - 1);
    _authPass[sizeof(_authPass) - 1] = '\0';
    ESP8266BASE_LOG_I("Web ", "web_password_updated password=[redacted] password_length=%u result=success",
                      (unsigned)strlen(_authPass));
    _redirect("/auth?saved=1");
}

#if ESP8266BASE_USE_OTA && !ESP8266BASE_PROFILE_MQTT_TERMINAL
void Esp8266BaseWeb::_handleOtaGet() {
    if (!checkAuth()) return;
    sendHeader();
    sendContent_P(WEB_OTA_FORM);
    sendFooter();
}
#endif

#if !ESP8266BASE_PROFILE_MQTT_TERMINAL
#if ESP8266BASE_USE_FILELOG
void Esp8266BaseWeb::_handleLogsGet() {
    if (!checkAuth()) return;
    sendHeader();
    sendContent_P(WEB_LOGS_PRE);

    Esp8266BaseFileLog::flush();

    char maxBuf[16];
    char totalBuf[16];
    Esp8266BaseUtil::formatBytes(Esp8266BaseFileLog::maxBytes(), maxBuf, sizeof(maxBuf));
    Esp8266BaseUtil::formatBytes(Esp8266BaseFileLog::maxBytes() * Esp8266BaseFileLog::rotateFiles(),
                                 totalBuf, sizeof(totalBuf));
    sendChunk("<p>File log: ");
    sendChunk(Esp8266BaseFileLog::isEnabled() ? "enabled" : "disabled");
    sendChunk("<br>Mode: ");
    sendChunk(Esp8266BaseFileLog::modeName());
    sendChunk("<br>Path: ");
    _sendAttrEscaped(Esp8266BaseFileLog::path());
    char line[96];
    snprintf(line, sizeof(line), "<br>Rotation files: %u",
             (unsigned)Esp8266BaseFileLog::rotateFiles());
    sendChunk(line);

    if (Esp8266BaseFileLog::bufferEnabled()) {
        char usedBuf[16];
        char sizeBuf[16];
        Esp8266BaseUtil::formatBytes(Esp8266BaseFileLog::bufferUsed(), usedBuf, sizeof(usedBuf));
        Esp8266BaseUtil::formatBytes(Esp8266BaseFileLog::bufferSize(), sizeBuf, sizeof(sizeBuf));
        snprintf(line, sizeof(line),
                 "<br>Buffer: %s / %s<br>Flush interval: %lus",
                 usedBuf, sizeBuf,
                 (unsigned long)(Esp8266BaseFileLog::flushIntervalMs() / 1000UL));
        sendChunk(line);
    } else {
        sendChunk("<br>Buffer: disabled");
    }
    snprintf(line, sizeof(line), "<br>Max per file: %s<br>Max total: %s",
             maxBuf, totalBuf);
    sendChunk(line);
    sendChunk("<br>Segments: ");
    for (uint8_t i = 0; i < Esp8266BaseFileLog::rotateFiles(); i++) {
        char segBuf[16];
        Esp8266BaseUtil::formatBytes(Esp8266BaseFileLog::segmentSize(i), segBuf, sizeof(segBuf));
        snprintf(line, sizeof(line), "%s%u=%s", i == 0 ? "" : ", ", (unsigned)i, segBuf);
        sendChunk(line);
    }
    sendChunk("</p>");

    uint8_t selected = 0;
    if (_server.hasArg("seg")) {
        int v = _server.arg("seg").toInt();
        if (v >= 0 && v < (int)Esp8266BaseFileLog::rotateFiles()) {
            selected = (uint8_t)v;
        }
    }

    sendChunk("<p class=tabs><span>Files:</span> ");
    for (uint8_t i = 0; i < Esp8266BaseFileLog::rotateFiles(); i++) {
        char segBuf[16];
        Esp8266BaseUtil::formatBytes(Esp8266BaseFileLog::segmentSize(i), segBuf, sizeof(segBuf));
        if (i == selected) {
            sendChunk("<b>");
            if (i == 0) {
                snprintf(line, sizeof(line), "current-0 (%s)", segBuf);
            } else {
                snprintf(line, sizeof(line), "history-%u (%s)", (unsigned)i, segBuf);
            }
            sendChunk(line);
            sendChunk("</b>");
        } else {
            snprintf(line, sizeof(line), "<a href='/logs?seg=%u'>", (unsigned)i);
            sendChunk(line);
            if (i == 0) {
                snprintf(line, sizeof(line), "current-0 (%s)", segBuf);
            } else {
                snprintf(line, sizeof(line), "history-%u (%s)", (unsigned)i, segBuf);
            }
            sendChunk(line);
            sendChunk("</a>");
        }
        if (i + 1 < Esp8266BaseFileLog::rotateFiles()) sendChunk(" ");
    }
    sendChunk("</p><pre>");

    char selectedPath[36];
    const char* selectedLabel = "current-0";
    uint32_t selectedSize = Esp8266BaseFileLog::segmentSize(selected);
    if (selected == 0) {
        snprintf(selectedPath, sizeof(selectedPath), "%s", Esp8266BaseFileLog::path());
    } else {
        snprintf(selectedPath, sizeof(selectedPath), "%s.%u",
                 Esp8266BaseFileLog::path(), (unsigned)selected);
        snprintf(line, sizeof(line), "history-%u", (unsigned)selected);
        selectedLabel = line;
    }
    _sendLogSection(selectedLabel, selectedPath, selectedSize);
    sendChunk("</pre>");
    sendFooter();
}

void Esp8266BaseWeb::_handleLogsClearPost() {
    if (!checkAuth()) return;
    _markRequest();
    bool ok = Esp8266BaseFileLog::clear();
    ESP8266BASE_LOG_I("Web ", "log_file_clear_requested result=%s", ok ? "success" : "failed");
    _redirect(ok ? "/system?cleared=1" : "/system?error=clear_failed");
}

void Esp8266BaseWeb::_handleFileLogPost() {
    if (!checkAuth()) return;
    _markRequest();

    Esp8266BaseFileLog::Mode mode = Esp8266BaseFileLog::OFF;
    if (!_fileLogModeFromArg(_server.arg("mode"), mode)) {
        ESP8266BASE_LOG_W("Web ", "filelog_mode_rejected value=%s", _server.arg("mode").c_str());
        _redirect("/system?error=filelog_invalid_mode");
        return;
    }

    ESP8266BASE_LOG_W("Web ", "filelog_mode_requested old=%s new=%s",
                      Esp8266BaseFileLog::modeName(),
                      mode == Esp8266BaseFileLog::OFF ? "off" :
                      mode == Esp8266BaseFileLog::ERROR ? "error" :
                      (mode == Esp8266BaseFileLog::WARN ? "warn" : "info"));
    bool ok = Esp8266BaseFileLog::setMode(mode);
    _redirect(ok ? "/system?filelog_saved=1" : "/system?error=filelog_save_failed");
}
#endif

void Esp8266BaseWeb::_handleHostnamePost() {
    if (!checkAuth()) return;
    _markRequest();

    char hostname[33] = "";
    strncpy(hostname, _server.arg("hostname").c_str(), sizeof(hostname) - 1);
    _trimWhitespace(hostname);

    if (!Esp8266Base::isValidHostname(hostname)) {
        ESP8266BASE_LOG_W("Web ", "hostname_update_rejected reason=invalid value=%s", hostname);
        _redirect("/system?error=hostname_invalid");
        return;
    }

    if (!Esp8266BaseConfig::setStr(ESP8266BASE_CFG_KEY_HOSTNAME, hostname)) {
        ESP8266BASE_LOG_E("Web ", "hostname_update_failed hostname=%s", hostname);
        _redirect("/system?error=hostname_save_failed");
        return;
    }

    ESP8266BASE_LOG_I("Web ", "hostname_saved hostname=%s reboot_required=yes", hostname);
    _redirect("/system?hostname_saved=1");
}

void Esp8266BaseWeb::_handleHostnameApiGet() {
    _markRequest();
    if (!verifyAuth()) {
        _server.send(401, "application/json", "{\"ok\":false,\"error\":\"unauthorized\"}");
        return;
    }

    char persisted[33] = "";
    bool found = Esp8266BaseConfig::getStr(ESP8266BASE_CFG_KEY_HOSTNAME, persisted, sizeof(persisted), "");
    bool persistedValid = found && persisted[0] && Esp8266Base::isValidHostname(persisted);
    const char* defaultHostname = _validatedDefaultHostname();
    bool rebootRequired = persistedValid && strcmp(persisted, Esp8266Base::hostname()) != 0;

    WiFiClient& client = _server.client();
    client.setNoDelay(true);
    client.setTimeout(1500);
    sendContent_P(PSTR("HTTP/1.1 200 OK\r\nContent-Type: application/json\r\n"
                       "Connection: close\r\nCache-Control: no-store\r\n\r\n"));
    WebJsonOutput output{client, millis()};
    Esp8266BaseInternal::WebJsonWriter json(_writeWebJson, &output);
    json.text("hostname", Esp8266Base::hostname());
    json.text("persisted", persistedValid ? persisted : "");
    json.text("default", defaultHostname);
    json.boolean("rebootRequired", rebootRequired);
    if (!json.finish()) { client.stop(); return; }
    client.flush();
    client.stop();
}

