tangyangguang/Esp8266Base/src/Esp8266BaseWeb.cpp
void Esp8266BaseWeb::_handleHostnameApiPost() {
    _markRequest();
    if (!verifyAuth()) {
        _server.send(401, "application/json", "{\"ok\":false,\"error\":\"unauthorized\"}");
        return;
    }

    char hostname[33] = "";
    strncpy(hostname, _server.arg("hostname").c_str(), sizeof(hostname) - 1);
    _trimWhitespace(hostname);

    if (!Esp8266Base::isValidHostname(hostname)) {
        ESP8266BASE_LOG_W("Web ", "hostname_api_update_rejected reason=invalid value=%s", hostname);
        _server.send(400, "application/json", "{\"ok\":false,\"error\":\"invalid_hostname\"}");
        return;
    }

    if (!Esp8266BaseConfig::setStr(ESP8266BASE_CFG_KEY_HOSTNAME, hostname)) {
        ESP8266BASE_LOG_E("Web ", "hostname_api_update_failed hostname=%s", hostname);
        _server.send(500, "application/json", "{\"ok\":false,\"error\":\"save_failed\"}");
        return;
    }

    ESP8266BASE_LOG_I("Web ", "hostname_api_saved hostname=%s reboot_required=yes", hostname);
    _server.send(200, "application/json", "{\"ok\":true,\"rebootRequired\":true}");
}

void Esp8266BaseWeb::_handleSystemGet() {
    if (!checkAuth()) return;
    sendHeader();
#if ESP8266BASE_USE_FILELOG
    if (_server.hasArg("cleared")) {
        sendChunk("<p class=ok>File logs cleared.</p>");
    } else if (_server.hasArg("filelog_saved")) {
        sendChunk("<p class=ok>File log mode saved.</p>");
    } else
#endif
    if (_server.hasArg("hostname_saved")) {
        sendChunk("<p class=ok>Hostname saved. Reboot to apply network discovery changes.</p>");
    } else if (_server.hasArg("error")) {
        char err[24] = "";
        strncpy(err, _server.arg("error").c_str(), sizeof(err) - 1);
#if ESP8266BASE_USE_FILELOG
        if (strcmp(err, "clear_failed") == 0) {
            sendChunk("<p class=err>Failed to clear file logs.</p>");
        } else if (strcmp(err, "filelog_invalid_mode") == 0) {
            sendChunk("<p class=err>Invalid file log mode.</p>");
        } else if (strcmp(err, "filelog_save_failed") == 0) {
            sendChunk("<p class=err>Failed to save file log mode.</p>");
        } else
#endif
        if (strcmp(err, "hostname_invalid") == 0) {
            sendChunk("<p class=err>Invalid hostname.</p>");
        } else if (strcmp(err, "hostname_save_failed") == 0) {
            sendChunk("<p class=err>Failed to save hostname.</p>");
        }
    }
    sendChunk("<h2>System</h2><div class=grid>");
    _sendHostnameSystemSection();
#if ESP8266BASE_USE_FILELOG
    _sendFileLogSystemSection();
#endif
    sendContent_P(WEB_SYSTEM_PAGE);
    sendFooter();
}

void Esp8266BaseWeb::_handleRebootPost() {
    if (!checkAuth()) return;
    sendHeader();
    sendContent_P(WEB_REBOOTING);
    sendFooter();
    _server.client().stop();
    ESP8266BASE_LOG_I("Web ", "reboot_requested source=web");
#if ESP8266BASE_USE_RECORD_STORE
    Esp8266BaseRecordStore::prepareMaintenance();
#endif
#if ESP8266BASE_USE_CONFIG
    Esp8266BaseConfig::flush();
#endif
#if ESP8266BASE_USE_FILELOG
    Esp8266BaseFileLog::flush();
#endif
    delay(500);
    ESP.restart();
}
#else
void Esp8266BaseWeb::_handleTerminalRoot() {
    _markRequest();
    if (Esp8266BaseWiFi::state() == Esp8266BaseWiFiState::AP_CONFIG) {
        _redirect("/wifi");
    } else {
        _redirect(ESP8266BASE_TERMINAL_HOME_PATH);
    }
}

void Esp8266BaseWeb::_handleTerminalDispatch() {
    const String& uri = _server.uri();
    const HTTPMethod method = _server.method();
    _markRequest();
    // Browser icon probes: answer with no auth and no memory-heavy response.
    if (method == HTTP_GET &&
        (uri == "/favicon.ico" || uri.startsWith("/apple-touch-icon"))) {
        _sendIconResponse();
        return;
    }
    if (uri == "/" && method == HTTP_GET) return _handleTerminalRoot();
    if (uri == "/wifi" && method == HTTP_GET) return _handleWiFiGet();
    if (uri == "/wifi" && method == HTTP_POST) return _handleWiFiPost();
    if (uri == "/auth" && method == HTTP_GET) return _handleAuthGet();
    if (uri == "/auth" && method == HTTP_POST) return _handleAuthPost();
    if (uri == "/health" && method == HTTP_GET) return _handleHealth();
    _handleNotFound();
}
#endif

void Esp8266BaseWeb::_handleHealth() {
    _markRequest();
    const char* wifiState = "idle";
    const char* ip = "";
    if (Esp8266BaseWiFi::isConnected()) {
        wifiState = "connected";
        ip = Esp8266BaseWiFi::ip();
    } else if (Esp8266BaseWiFi::state() == Esp8266BaseWiFiState::AP_CONFIG) {
        wifiState = "ap_config";
        ip = "192.168.4.1";
    } else if (Esp8266BaseWiFi::state() == Esp8266BaseWiFiState::CONNECTING) {
        wifiState = "connecting";
    }

    const char* ntpState = "disabled";
#if ESP8266BASE_USE_NTP
    ntpState = Esp8266BaseNTP::isSynced() ? "synced" : "pending";
#endif
    bool lastWdtReset = false;
#if ESP8266BASE_USE_WATCHDOG
    lastWdtReset = Esp8266BaseWatchdog::wasWatchdogReset();
#endif
    bool otaInProgress = false;
#if ESP8266BASE_USE_OTA
    otaInProgress = Esp8266BaseOTA::isInProgress();
#endif

    const char* mqttState = "disabled";
    const char* mqttReason = "none";
    uint32_t mqttAttempt = 0;
    bool mqttConnected = false;
    int mqttTlsError = 0;
#if ESP8266BASE_USE_MQTT
    mqttState = Esp8266BaseMQTT::stateName();
    mqttReason = Esp8266BaseMQTT::lastDisconnectReasonName();
    mqttAttempt = Esp8266BaseMQTT::attemptCount();
    mqttConnected = Esp8266BaseMQTT::connected();
    mqttTlsError = Esp8266BaseMQTT::lastTlsErrorCode();
#endif
#if ESP8266BASE_USE_JOURNAL
    const char* diagLevel = Esp8266BaseJournal::diagLevel() == 2 ? "error"
                          : Esp8266BaseJournal::diagLevel() == 1 ? "attention" : "ok";
    char diagBrief[48] = "ok";
    {
        Esp8266BaseJournalSummary jsum;
        Esp8266BaseJournal::cachedSummary(jsum);
        if (jsum.stalls > 0) {
            snprintf(diagBrief, sizeof(diagBrief), "stall=%u", (unsigned)jsum.stalls);
        } else if (jsum.mqttClosed > jsum.mqttClosedReasons[1]) {
            snprintf(diagBrief, sizeof(diagBrief), "mqtt_closed=%u last=%u",
                     (unsigned)(jsum.mqttClosed - jsum.mqttClosedReasons[1]),
                     (unsigned)jsum.lastMqttReason);
        } else if (jsum.wifiLost > 0) {
            snprintf(diagBrief, sizeof(diagBrief), "wifi_lost=%u", (unsigned)jsum.wifiLost);
        }
    }
#else
    const char* diagLevel = "";
    const char* diagBrief = "";
#endif

    // 分块输出固定 JSON。SSID 按产品诊断契约公开；不包含 broker、clientId、
    // 用户名、密码或证书。
    WiFiClient& client = _server.client();
    client.setNoDelay(true);
    client.setTimeout(1500);
    sendContent_P(PSTR("HTTP/1.1 200 OK\r\nContent-Type: application/json\r\n"
                       "Connection: close\r\nCache-Control: no-store\r\n\r\n"));
    WebJsonOutput output{client, millis()};
    Esp8266BaseInternal::WebJsonWriter json(_writeWebJson, &output);
    json.text("hostname", Esp8266Base::hostname());
    json.text("firmware", _fwName);
    json.text("version", _fwVersion);
    json.number("uptime", millis() / 1000UL);
    json.number("heap", ESP.getFreeHeap());
    json.number("maxBlock", ESP.getMaxFreeBlockSize());
    json.text("wifi", wifiState);
    json.text("wifiSsid", Esp8266BaseWiFi::isConnected() ? Esp8266BaseWiFi::ssid() : "");
    json.signedNumber("wifiRssi", Esp8266BaseWiFi::isConnected() ? Esp8266BaseWiFi::rssi() : 0);
    json.text("ip", ip);
    json.text("ntp", ntpState);
    json.number("wifiAttempt", Esp8266BaseWiFi::attemptCount());
    json.number("wifiRadioReset", Esp8266BaseWiFi::radioResetCount());
    json.text("mqtt", mqttState);
    json.boolean("mqttConnected", mqttConnected);
    json.number("mqttAttempt", mqttAttempt);
    json.text("mqttLastReason", mqttReason);
    json.signedNumber("mqttTlsError", mqttTlsError);
    json.boolean("lastWdtReset", lastWdtReset);
    json.boolean("otaInProgress", otaInProgress);
#if ESP8266BASE_USE_WATCHDOG
    json.number("recoveryCause", static_cast<uint32_t>(Esp8266BaseWatchdog::lastRecoveryCause()));
    json.number("recoveryPhase", static_cast<uint32_t>(Esp8266BaseWatchdog::lastStallPhase()));
    json.number("recoveryBudget", Esp8266BaseWatchdog::consecutiveRecoveryRestarts());
#endif
    json.text("diagLevel", diagLevel);
    json.text("diagBrief", diagBrief);
    if (!json.finish()) { client.stop(); return; }
    client.flush();
    client.stop();
}

void Esp8266BaseWeb::_handleNotFound() {
    _markRequest();
    const String& uri = _server.uri();
    if (_server.method() == HTTP_GET &&
        (uri == "/favicon.ico" || uri.startsWith("/apple-touch-icon"))) {
        _sendIconResponse();
        return;
    }
    if (!checkAuth()) return;
    _server.send(404, "text/plain", "Not found");
}
#endif
